## Задача1. 
Напишите программу-калькулятор, которая запрашивает у пользователя два числа и выполняет операцию возведения первого числа в степень второго числа. Если введены некорректные числа или происходит деление на ноль, необходимо обработать соответствующие исключения и вывести информативное сообщение об ошибке.
### Важно! С использованием принципа одного уровня абстракции!

```python
# Определение класса пользовательского исключения
class InvalidInputException(Exception):
    pass

# Определение класса
class PowerCalculator:
    # Метод для вычисления степени
    def calculatePower(self, base, exponent):
        if base == 0 and exponent < 0:
            # Вызов пользовательского исключения InvalidInputException
            raise InvalidInputException("Неверный ввод: основание не может быть равно нулю, а показатель степени не может быть отрицательным.")
        return base ** exponent

# Основная функция программы
def main():
    # Создание объекта класса PowerCalculator
    calculator = PowerCalculator()
    print("Начало работы")
    while True:
        try:
            base = int(input("Введите первое число (основание): "))
            exponent = int(input("Введите второе число (степень): "))
            result = calculator.calculatePower(base, exponent) # Вычисление степени с помощью метода calculatePower
            print("Результат:", result)
        except ValueError: # Обработка исключения при неверном вводе чисел
            print("Неверный ввод: введите допустимые числа.")
        except InvalidInputException as error: # Обработка пользовательского исключения InvalidInputException
            print(error)
        
        print('Для завершения работы программы нажмите "Enter", или введите любой символ для продолжения...')
        end = input()
        if not end:
            break    
    print('Завершение работы')

main()
```

В этой задаче мы создаем класс PowerCalculator, который содержит метод calculatePower(), выполняющий операцию возведения числа в степень. Если введено некорректное основание (ноль) и отрицательная степень, выбрасывается исключение InvalidInputException.

*В приведенном ниже коде класс PowerCalculator и его метод calculatePower представляют абстракцию вычисления степени числа. Они скрывают детали реализации вычисления степени и предоставляют пользователю интерфейс для выполнения этой операции.*

В методе main() мы запрашиваем у пользователя основание и показатель степени, вызываем метод calculatePower() и выводим результат. Если введены некорректные числа или происходит ошибка ввода, соответствующие исключения перехватываются и выводится информативное сообщение об ошибке.

Обратите внимание, что в этой задаче мы использовали собственное исключение InvalidInputException, чтобы явно указать на некорректный ввод. Это помогает разделить обработку ошибок на соответствующие уровни абстракции.

*В этой задаче мы создаем класс PowerCalculator, который содержит метод calculatePower(), выполняющий операцию возведения числа в степень. Если введено некорректное основание (ноль) и отрицательная степень, выбрасывается исключение InvalidInputException. В методе main() мы запрашиваем у пользователя основание и показатель степени, вызываем метод calculatePower() и выводим результат. Если введены некорректные числа или происходит ошибка ввода, соответствующие исключения перехватываются и выводится информативное сообщение об ошибке.
Обратите внимание, что в этой задаче мы использовали собственное исключение InvalidInputException, чтобы явно указать на некорректный ввод. Это помогает разделить обработку ошибок на соответствующие уровни абстракции.*

---
Подготовил студент Geek Brains - **[Ивлев Павел](https://github.com/asics282)**.